# -*- coding: utf-8 -*-
__author__ = 'vahid'

MINYEAR = 1
MAXYEAR = 3178

PERSIAN_WEEKDAY_NAMES = {
            0: u'دوشنبه',
            1: u'سه شنبه',
            2: u'چهارشنبه',
            3: u'پنجشنبه',
            4: u'جمعه',
            5: u'شنبه',
            6: u'یکشنبه'}

PERSIAN_WEEKDAY_ABBRS = {
            0: u'د',
            1: u'س',
            2: u'چ',
            3: u'پ',
            4: u'ج',
            5: u'ش',
            6: u'ی'}

PERSIAN_MONTH_NAMES = {
            1:  u'فروردین',
            2:  u'اردیبهشت',
            3:  u'خرداد',
            4:  u'تیر',
            5:  u'مرداد',
            6:  u'شهریور',
            7:  u'مهر',
            8:  u'آبان',
            9:  u'آذر',
            10: u'دی',
            11: u'بهمن',
            12: u'اسفند'}
PERSIAN_MONTH_ABBRS = {
            1:  u'فر',
            2:  u'ار',
            3:  u'خر',
            4:  u'تی',
            5:  u'مر',
            6:  u'شه',
            7:  u'مه',
            8:  u'آب',
            9:  u'آذ',
            10: u'دی',
            11: u'به',
            12: u'اس'}